/********************************************************************************
** ÎÄ¼þÃû³Æ: UART.h
** Ãè    Êö: UARTÍ¨ÐÅÇý¶¯³ÌÐòÍ·ÎÄ¼þ
** °æÈ¨ËùÓÐ: ÉîÛÚÊÐºÍ³É¹¤¿Ø¿Æ¼¼ÓÐÏÞ¹«Ë¾
** ½¨Á¢ÈÕÆÚ: 2017-07-05
********************************************************************************/
#ifndef __UART_H
#define __UART_H


/**********************************Í·ÎÄ¼þ°üº¬***********************************/
#include "user.h"
/************************************ºê¶¨Òå*************************************/

/*********************************Êý¾ÝÀàÐÍ¶¨Òå**********************************/
typedef volatile enum
{
	UART_TX_IDLE,	//¿ÕÏÐ
	UART_TX_BUSY,	//·±Ã¦
}uart_tx_state_t;	//·¢ËÍ×´Ì¬¶¨Òå

typedef struct
{
	uart_tx_state_t	state;
	char	*buff;	//Êý¾Ý»º´æ
	u16	cnt;//·¢ËÍ¼ÇÊý
	u16 len;//·¢ËÍ³¤¶È
	u16 delay;		//
}uart_tx_t;		//·¢ËÍ½á¹¹Ìå

typedef struct
{
	char *buff;		//Êý¾Ý»º´æ
	u16 cnt;
	u8 delay;		//ÊÕµ½Êý¾ÝºóÑÓÊ±Ò»¶ÎÊ±¼äÔÙ½âÂë
}uart_rx_t;		//½ÓÊÕ½á¹¹Ìå

typedef struct
{
	uart_tx_t	tx;
	uart_rx_t	rx;
}uart_t;	//´®¿Ú½á¹¹Ìå

extern uart_t uart;

/***********************************º¯ÊýÉùÃ÷************************************/

#endif

